{
    "version": "https://jsonfeed.org/version/1",
    "title": "Nested - Blog",
    "description": "",
    "home_page_url": "https://se4nn.github.io/gh-pages",
    "feed_url": "https://se4nn.github.io/gh-pages/feed.json",
    "user_comment": "",
    "icon": "https://se4nn.github.io/gh-pages/media/website/nestedLogo.png",
    "author": {
        "name": "Nested"
    },
    "items": [
        {
            "id": "https://se4nn.github.io/gh-pages/Release-v0.0.1/",
            "url": "https://se4nn.github.io/gh-pages/Release-v0.0.1/",
            "title": "Release v0.0.1",
            "summary": "Some release notes around something cool and fun ",
            "content_html": "<p>Some release notes around something cool and fun</p>\n<p> </p>",
            "image": "https://se4nn.github.io/gh-pages/media/posts/3/DSC_4798.jpg",
            "author": {
                "name": "Nested"
            },
            "tags": [
                   "Release"
            ],
            "date_published": "2018-09-27T17:19:08+01:00",
            "date_modified": "2018-09-27T17:23:53+01:00"
        },
        {
            "id": "https://se4nn.github.io/gh-pages/Diversity-and-Inclusion-in-Nested-Engineering/",
            "url": "https://se4nn.github.io/gh-pages/Diversity-and-Inclusion-in-Nested-Engineering/",
            "title": "Diversity &amp; Inclusion in Nested Engineering",
            "summary": "Diversity &amp; Inclusion in Nested EngineeringDiversity &amp; inclusion are extremely important to&hellip;",
            "content_html": "<h1 id=\"183a\" class=\"graf graf--h3 graf-after--figure graf--title\">Diversity &amp; Inclusion in Nested Engineering</h1>\n<p id=\"612a\" class=\"graf graf--p graf-after--h3\">Diversity &amp; inclusion are extremely important to us in the Nested engineering team. We recognise both the broad array of <a href=\"https://www.scientificamerican.com/article/how-diversity-makes-us-smarter/\"  class=\"markup--anchor markup--p-anchor\" rel=\"noopener noreferrer\" target=\"_blank\">cultural / performance / team benefits</a> <strong class=\"markup--strong markup--p-strong\">and</strong> the ethical responsibility to promote diversity as a concern for startups.</p>\n<p id=\"7c77\" class=\"graf graf--p graf-after--p\">This page provides an up to date view of all the initiatives we are currently pushing forward as <em class=\"markup--em markup--p-em\">an engineering group</em> to action this. Diversity isn’t just a “People Team responsibility”, it is <strong class=\"markup--strong markup--p-strong\">everyone’s</strong> responsibility and publishing this ensures we hold ourselves accountable as a team. This covers:</p>\n<ul class=\"postList\">\n<li id=\"77b7\" class=\"graf graf--li graf-after--p\">Our Current Team</li>\n<li id=\"a487\" class=\"graf graf--li graf-after--li\">Tackling Bias</li>\n<li id=\"196c\" class=\"graf graf--li graf-after--li\">Promoting Inclusion</li>\n<li id=\"f77d\" class=\"graf graf--li graf-after--li\">Investing in the Community</li>\n</ul>\n<h3 id=\"3f30\" class=\"graf graf--h3 graf-after--li\">Our Current Team (<em class=\"markup--em markup--h3-em\">as of 08/18)</em></h3>\n<p><img src=\"https://cdn-images-1.medium.com/max/1600/1*xdrrh5sz9p8QUTOW6rz9gQ.png\"></p>\n<p id=\"d53d\" class=\"graf graf--p graf--leading\"><em class=\"markup--em markup--p-em\">N.b. There are many forms of diversity that we consider and actively push to promote (gender, sexual orientation, age, disability etc). Although we strive to ensure we meet the needs of all demographics &amp; groups, at our current team size our team metrics only cover our representative score for the larger demographic groups, namely sex and race.</em></p>\n<p id=\"16e0\" class=\"graf graf--p graf-after--p\"><em>08/18: With our current team, we are well below the industry average and where we would like to be w.r.t. diversity of the sexes. A recent discussion raised by one of our female product managers at all-hands highlighted how this could impact the feeling of inclusion, leading to a number of initiatives to challenge this.</em></p>\n<h3 id=\"053f\" class=\"graf graf--h3 graf-after--p\">Tackling Bias</h3>\n<p id=\"dca8\" class=\"graf graf--p graf-after--h3\">Our team has taken a number of steps to ensure we tackle any systemic / unconscious / circumstantial biases in our technical recruitment.</p>\n<ul class=\"postList\">\n<li id=\"653a\" class=\"graf graf--li graf-after--p\"><strong class=\"markup--strong markup--li-strong\">Software Language Agnostic Interviews<br></strong>Our primary language of choice is Elixir, it’s awesome for creating well written &amp; fast services. As a new language (<em class=\"markup--em markup--li-em\">in relative terms</em>) it’s <a href=\"https://www.forbes.com/sites/alexkonrad/2014/08/12/these-programming-languages-have-the-most-and-fewest-female-coders/#2132477355c1\"  class=\"markup--anchor markup--li-anchor\" rel=\"noopener noreferrer\" target=\"_blank\">not so great for diversity</a> and presents a circumstantial bias. This is why we’ve taken steps to ensure we attract, fairly evaluate and invest in training people from any language background.</li>\n<li id=\"b02c\" class=\"graf graf--li graf-after--li\"><strong class=\"markup--strong markup--li-strong\">Interview Scoring <br></strong><a href=\"https://hbr.org/2016/04/how-to-take-the-bias-out-of-interviews\"  class=\"markup--anchor markup--li-anchor\" rel=\"noopener noreferrer\" target=\"_blank\">Consistent structure and transparent calibration</a> are key to addressing unconscious bias in interviews. We have introduced a consistent structure and are introducing scoring in technical interviews to push this. Interviewers provide feedback independently before discussing candidates, to avoid cross-interviewer influence.</li>\n<li id=\"5de1\" class=\"graf graf--li graf-after--li\"><strong class=\"markup--strong markup--li-strong\">Interview Panel Selection<br></strong>We strive to tackle unconscious bias with training and structured scoring, but we know this can <a href=\"https://theconversation.com/think-youre-all-for-gender-equality-your-unconscious-may-have-other-ideas-69520\"  class=\"markup--anchor markup--li-anchor\" rel=\"noopener noreferrer\" target=\"_blank\">never be a 100% fix</a>. When possible, we ensure appropriate demographics are represented on our interviewer panels.</li>\n<li id=\"5ec6\" class=\"graf graf--li graf-after--li\"><strong class=\"markup--strong markup--li-strong\">Metrics<br></strong>We’re a data-driven company with our product, we know this gets the best results. The same is true for diversity. We’re now introducing metrics to track acceptance rates at different hiring steps, broken down by demographic, to measure and highlight anything that may indicate bias.</li>\n</ul>\n<h3 id=\"22e1\" class=\"graf graf--h3 graf-after--li\">Promoting Inclusion</h3>\n<p id=\"5bd9\" class=\"graf graf--p graf-after--h3\">We recognise our starting point as a team (predominantly white male) can unintentionally lead to a feeling of isolation if we aren’t proactive on inclusion.</p>\n<ul class=\"postList\">\n<li id=\"e3d2\" class=\"graf graf--li graf-after--p\"><strong class=\"markup--strong markup--li-strong\">Equal Pay<br></strong>We take a hard-line approach to this and guarantee that all salaries are fixed across the same level<em class=\"markup--em markup--li-em\">*</em>, regardless of sex, gender or any other grouping.</li>\n<li id=\"09ca\" class=\"graf graf--li graf-after--li\"><strong class=\"markup--strong markup--li-strong\">Flexible hours<br></strong>Not obvious at first, but fixed hours from 9–5 can act to exclude or neglect the needs of different groups (be it religious, family oriented etc). We allow for flexible working hours to ensure we accommodate individual needs.</li>\n<li id=\"3d45\" class=\"graf graf--li graf-after--li\"><strong class=\"markup--strong markup--li-strong\">Language<br></strong>It’s a simple one but something we are trying to tackle. Terms like “guys” and phrases like “man up” can do a lot to create a one-sided culture. We use <a href=\"https://textio.com/\"  class=\"markup--anchor markup--li-anchor\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">https://textio.com/</a> to filter written language, and take it on ourselves to self-regulate our chat around the office / in meetings.</li>\n<li id=\"ee93\" class=\"graf graf--li graf-after--li\"><strong class=\"markup--strong markup--li-strong\">Office Space<br></strong>Our office is fully accessible, with de-gendered bathrooms each with sanitary packs.</li>\n</ul>\n<p id=\"eba3\" class=\"graf graf--p graf-after--li\">These are a great starting point, as our team grows we’ll keep pushing more efforts to ensure we build a great working environment for anyone coming in.</p>\n<h3 id=\"b701\" class=\"graf graf--h3 graf-after--p\">Investing in the Community</h3>\n<p id=\"a006\" class=\"graf graf--p graf-after--h3\">Discussed above, we’re aware tech has an innate demographic slant. It isn’t enough to lean on this as a justification for low levels of diversity, it’s our responsibility to contribute to <strong class=\"markup--strong markup--p-strong\">building</strong> diversity <strong class=\"markup--strong markup--p-strong\">in</strong> the community.</p>\n<ul class=\"postList\">\n<li id=\"068d\" class=\"graf graf--li graf-after--p\"><strong class=\"markup--strong markup--li-strong\">Training<br></strong>We contribute to training the community, be it our own <a href=\"https://codesync.global/media/convince-your-line-manager/\"  class=\"markup--anchor markup--li-anchor\" rel=\"noopener noreferrer\" target=\"_blank\">on site</a> training or our developers who’ve contributed to programs like ElixirBridge. Efforts like these help to push forward the community as a whole (and attract a more diverse group to Elixir, which we love as a language!)</li>\n<li id=\"cbcc\" class=\"graf graf--li graf-after--li\"><strong class=\"markup--strong markup--li-strong\">Awareness<br></strong>Our team have attended a number of diversity-oriented conferences over the past year, to raise awareness and show support.</li>\n</ul>\n<p id=\"7942\" class=\"graf graf--p graf-after--li\">These are really just the beginning, we recognise the issue and know there’s a lot more we’ll need to do as our team grows. We’re making progress but would love to hear your feedback. What puts you off applying to places? What strategies have you seen that have driven inclusion in a meaningful and sincere way?</p>\n<p id=\"ec21\" class=\"graf graf--p graf-after--p graf--trailing\"><em class=\"markup--em markup--p-em\">*For internal context — “same level” includes TRM in the definition of level</em></p>",
            "image": "https://se4nn.github.io/gh-pages/media/posts/2/DSC_4748.jpg",
            "author": {
                "name": "Nested"
            },
            "tags": [
                   "Product",
                   "Blog"
            ],
            "date_published": "2018-09-27T17:11:39+01:00",
            "date_modified": "2018-09-27T17:12:13+01:00"
        },
        {
            "id": "https://se4nn.github.io/gh-pages/gregs-home-sale/",
            "url": "https://se4nn.github.io/gh-pages/gregs-home-sale/",
            "title": "Greg used Nested to sell his home in Dulwich and flat in Vauxhall",
            "summary": "Tell us a little about the properties you sold with Nested?We had&hellip;",
            "content_html": "<h4 class=\"sc-bxivhb hARpcM\">Tell us a little about the properties you sold with Nested?</h4>\n<p>We had one large family home in the Dulwich area where we were living at the time, and we also had a smaller rental property in Vauxhall. We were planning to sell the rental property anyway, as it was becoming a hassle being a landlord. We hadn't initially intended to sell both with Nested, but it worked out well in the end.</p>\n<p><img src=\"https://nested.cdn.prismic.io/nested/42c03ff5873e7d20217b4ba34d495e77cd01682e_gregg_old.jpg\"></p>\n<h4>Why did you decide to move out of London?</h4>\n<p class=\"sc-bdVaJa gWWTLv\">What happened was we found a property down on the coast which ticked all our boxes, as it were. It really exceeded all our expectations of what we could end up with. My wife was just looking around, not really frantically searching or anything, and she found it.</p>\n<p class=\"sc-bdVaJa gWWTLv\">We had been in London almost 30 years and we had two kids under 10 at the time. On a bi-monthly basis my wife and I would I think think are we staying, are we going? And we would decide to stay, as we felt London was amazing, and it is amazing! About two-thirds of couples my age go through a similar process, everyone we know does the same thing. But we had talked about it a lot and it seemed like the right time to move.</p>\n<h4>How did you find out about Nested?</h4>\n<p class=\"sc-bdVaJa gWWTLv\">I’m an architect and one of my clients recommended I get take a look at what you do. To be honest, the whole chain problem hadn’t really seriously entered my mind, it seemed like something that happened in other people’s home sales. Then there was a daily adjustment of spreadsheets and budgets and sensitive dialogue with our buyers just to keep the thing on track.</p>\n<p class=\"sc-bdVaJa gWWTLv\">I had doubts about the advance at times, whether anyone would really give me that amount of money. I had no reason to think it wouldn’t be forthcoming, but no evidence that it definitely would. Right up to the day we were due to exchange and complete, we thought there was a chance could all go wrong, and we had put a non-refundable deposit down for the new property, and so there was still money we would have to kiss goodbye to if it fell through. I was lucky being involved in the industry as an architect, I had a bit more of an understanding and realism about the process.</p>\n<h4>What were your next steps to selling the properties?</h4>\n<p class=\"sc-bdVaJa gWWTLv\">We agreed an 11 month completion period with the owners of the house we wanted. Luckily, they were a lovely couple and one of them was an architect like myself, so we had a level of trust between us. Because we needed the value from both properties, we decided we couldn’t have two properties needing to exchange and complete in that time. We decided to use Nested on our rental property to have a certain bankable amount. I checked it out and put in all my details and it went fairly smoothly, we sold within 90 days above the advance.</p>\n<p class=\"sc-bdVaJa gWWTLv\">We’d already had an offer on our family home, we had agreed a price for the sofas and everything and it was all fine… until the day of the exchange. It turned out the people beneath our buyer pulled out, so after seven months of backwards and forwards we were left with nothing. Our buyer couldn’t continue and it all just collapsed. At this point, we were getting dangerously close to the deadline for completion. It was difficult to imagine that a conventional agent could actually sell in that time frame, so it was getting a bit hairy! We decided to use Nested on our family home as well to make sure we could complete on the house we wanted.</p>\n<h4>How was the sales process with us?</h4>\n<p class=\"sc-bdVaJa gWWTLv\">We managed to swap over to Nested from the traditional agent with enough time to complete. Nested found a buyer within the 90 days, but we didn’t complete within that period so we needed the advance. In the end it worked out, we took the advance and the proceeds from the flat sale, exchanged and moved in as planned… but it was hairy at times! I’ve bought and sold tons of stuff over the years and Nested was better than anything else I’ve ever been involved in. There was a level of intelligence and care and engagement which is usually not present. Whoever we spoke to, there was a lot more to them and you felt like you were treated more like a partner than just another customer they want to get rid of. That gave me a lot of confidence, bearing in mind I had just gone through it with a traditional agent, having interviewed four agents when we decided to sell!</p>\n<h4>How are things in your new home?</h4>\n<p class=\"sc-bdVaJa gWWTLv\">We’re living literally a metre away from the sea, our house is about 2.5 times bigger than our old one and we’ve got 15 miles of coastal walks either side around us. The kids are having a ball being down here and we’ve got a puppy, which was one of main the reasons for the move. Actually we took our puppy Poppy onto the beach for the first time yesterday and she’s loving it, and so are we really.</p>\n<p class=\"sc-bdVaJa gWWTLv\">We did things the opposite way around with our move, we found a property before we had the means to sell ours and made an emotional attachment to it. But with conventional means we wouldn’t have been able to do it, so it was great to be able to make the move with Nested.</p>",
            "image": "https://se4nn.github.io/gh-pages/media/posts/1/fff35-rita-rd-5.jpg",
            "author": {
                "name": "Nested"
            },
            "tags": [
                   "Customer Stories"
            ],
            "date_published": "2018-09-27T12:51:28+01:00",
            "date_modified": "2018-09-27T12:51:28+01:00"
        }
    ]
}
